Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: require_once( "a.php"); / / this will include a.php require_once("A.php"); / / this will include a.php again on Windows!
pt_br: require_once( "a.php"); / / isto irá incluir a.php require_once("A.php"); / / isto irá incluir a.php de novo no Windows!

source: See also: require(), include(), include_once(), get_required_files(), get_included_files(), readfile(), and virtual().
pt_br: Veja também: require(), include(), include_once(), get_required_files(), get_included_files(), readfile() e virtual().

source: reset() rewinds array's internal pointer to the first element.
pt_br: reset() retrocede o ponteiro interno de array para o primeiro elemento.

source: reset() returns the value of the first array element.
pt_br: reset() retorna o valor do primeiro elemento do array.

source: See also current(), each(), next(), and prev().
pt_br: Veja também current(), each(), next(), e prev().

source: If called from within a function, the return() statement immediately ends execution of the current function, and returns its argument as the value of the function call. return() will also end the execution of an eval() statement or script file.
pt_br: Se chamada em uma função, a instrução return() termina imediatamente a execução da função atual e retorna seu argumento como o valor da função. return() também termina a execução de uma instrução eval() ou de um script.

source: If called from the global scope, then execution of the current script file is ended.
pt_br: Se chamada no escopo global, a execução do script atual será terminada.

source: If the current script file was include() ed or require() ed, then control is passed back to the calling file.
pt_br: Se o arquivo do script atual foi incluído com include() ou require(), então a execução é devolvida para o arquivo chamador.

source: Furthermore, if the current script file was include() ed, then the value given to return() will be returned as the value of the include() Furthermore, if the current script file was include() ed, then the value given to return() will be returned as the value of the include() call.
pt_br: Especificamente para arquivos de script incluídos com include(), o valor fornecido para return() será devolvido como o valor da chamada include().

source: If return() is called from within the main script file, then script execution ends.
pt_br: Se return() for chamado do arquivo de script principal, então o programa pára.

source: If the current script file was named by the auto_prepend_file or auto_append_file configuration options in the configuration file, then that script file 's execution is ended.
pt_br: Se o arquivo de script atual é o configurado em auto_prepend_file ou auto_append_file do arquivo de configuração, então a execução desses scripts é finalizada.

source: For more information, see Returning values.
pt_br: Para maiores informações, veja Retornando Valores.

source: Note that since return() is a language construct and not a function, the parentheses surrounding its arguments are not required--in fact, it is more common to leave them out than to use them, although it doesn't matter one way or the other.
pt_br: Note que return() é um construtor de linguagem e não uma função, e parênteses em volta do seus argumentos não são necessários - - de fato, é mais comum não colocá-los que usá-los, sem, entretanto, haver diferença de um jeito ou de outro.

source: Resets the directory stream indicated by dir_handle to the beginning of the directory.
pt_br: Reinicia o stream do diretório indicado por dir_handle para o início do diretório.

source: Sets the file position indicator for handle to the beginning of the file stream.
pt_br: Muda o indicador de ponteiro de arquivo fp para o início do stream do arquivo.

source: If an error occurs, returns 0, otherwise it returns 1.
pt_br: Em sucesso, retorna 1.

source: The file pointer must be valid, and must point to a file successfully opened by fopen().
pt_br: O ponteiro de arquivo tem que ser válido e tem que apontar para um arquivo aberto com sucesso por fopen().

source: If you have opened the file in append ("a") mode, any data you write to the file will always be appended, regardless of the file position.
pt_br: Se voc6e abriu um arquivo no modo acréscimo (append - "a"), qualque dado que escrever no arquivo será sempre anexado no final, não importando a posição do ponteiro.

source: See also fseek() and ftell().
pt_br: Veja também fseek() e ftell().

source: Attempts to remove the directory named by dirname.
pt_br: Tenta remover o diretório com o nome de nomedodir.

source: The directory must be empty, and the relevant permissions must permit this.
pt_br: O diretório tem que estar vazio e as permissões relevantes autorizarem a esta operação.

source: See also mkdir() and unlink().
pt_br: Veja também mkdir() e unlink().

source: Returns the rounded value of val to specified precision (number of digits after the decimal point). precision can also be negative or zero (default).
pt_br: Retornar um valor arredondado de val em precision casas decimais. precision pode ser negativo ou zero (default).

source: PHP doesn' t handle strings like "12,300.2 "correctly by default.
pt_br: O PHP não manipula strings como "12,300.2" corretamente por padrão.

source: See converting from strings.
pt_br: Veja convertendo de strings.

source: The precision parameter is only available in PHP 4.
pt_br: O parâmetro precision foi acrescentado no PHP 4.

source: See also ceil() and floor().
pt_br: Veja também ceil() e floor().

source: This function sorts an array in reverse order (highest to lowest).
pt_br: Essa função ordena um array em ordem descrescente (do maior para o menor).

source: Example 1. rsort() example
pt_br: Exemplo de rsort()

source: $fruits = array ("lemon", "orange", "banana", "apple"); rsort ($fruits); reset ($fruits); while (list ($key, $val) = each ($fruits)) {echo "$key = $val\n";}
pt_br: $frutas = array ("limao", "laranja", "banana", "melancia"); rsort ($frutas); reset ($frutas); while (list ($chave, $valor) = each ($frutas)) {echo "$chave = $valor\n";}

source: 0 = orange 1 = lemon 2 = banana 3 = apple
pt_br: 0 = melancia 1 = limao 2 = laranja 3 = banana

source: The fruits have been sorted in reverse alphabetical order.
pt_br: As frutas foram ordenadas em ordem alfabética decrescente.

source: See also arsort(), asort(), ksort(), sort(), and usort().
pt_br: Veja também arsort(), asort(), ksort(), sort() e usort().

source: This function returns a string with whitespace stripped from the end of str.
pt_br: O Segundo parâmetro foi adicionado no PHP 4.1.0

source: Without the second parameter, rtrim() will strip these characters:
pt_br: Esta função retorna a string como os espaços em branco retirados do final de str.

# "" (ASCII 13 (0x0D)), a carriage return.
source: "\r" (ASCII 13 (0x0D)), a carriage return.
pt_br: "\n" (ASCII 10 (0x0A)), uma nova linha.

source: "\0" (ASCII 0 (0x00)), the NUL -byte.
pt_br: "\r" (ASCII 13 (0x0D)), um retorno de carro(ENTER).

source: Usage example of rtrim()
pt_br: Exemplo de uso da função rtrim()

source: ?php $text = "\t\tThese are a few words:)..."; $trimmed = rtrim($text); / / $trimmed = "\t\tThese are a few words:)... "$trimmed = rtrim($text," \t ."); / / $trimmed = "\t\tThese are a few words:) "$clean = rtrim($binary ,"\0x00..\0x1F"); / / trim the ASCII control characters at the end of $binary / / (from 0 to 31 inclusive)?
pt_br: ?php $text = "\t\tThese are a few words:)..."; $trimmed = rtrim($text); / / $trimmed = "\t\tThese are a few words:)... "$trimmed = rtrim($text," \t ."); / / $trimmed = "\t\tThese are a few words:) "$clean = rtrim($binary ,"\0x00..\0x1F"); / / retira os caracteres de controle ASCII ao final de $binary / / (de 0 até 31 inclusive)?

source: See also trim() and ltrim().
pt_br: Veja também trim() e ltrim().

source: Chapter 13.
pt_br: Capítulo 13.

source: Information may be passed to functions via the argument list, which is a comma-delimited list of variables and / or constants.
pt_br: Informações podem ser passadas para funções através da lista de argumentos, que é uma lista de variáveis e / ou constantes delimitados por vírgulas.

source: PHP supports passing arguments by value (the default), passing by reference, and default argument values.
pt_br: O PHP suporta a passagem de argumentos por valor (o padrão), passagem por referência e valores padrão de argumento.

source: Variable-length argument lists are supported only in PHP 4 and later; see Variable-length argument lists and the function references for func_num_args(), func_get_arg(), and func_get_args() for more information.
pt_br: Listas de argumentos de comprimento variável são suportadas apenas no PHP4 e posterior; veja Número de argumentos variável e as referências das funções func_num_args(), func_get_arg() e func_get_args() para mais informações.

source: A similar effect can be achieved in PHP 3 by passing an array of arguments to a function:
pt_br: Um efeito similar pode ser atingido no PHP 3 pela passagem de um array de argumentos para uma função:

source: function takes_array( $input) {echo "$input[0] + $input[1] = ", $input[0]+$input[1];}
pt_br: Fazendo argumentos serem passados por referência

source: By default, function arguments are passed by value (so that if you change the value of the argument within the function, it does not get changed outside of the function).
pt_br: Por padrão, argumentos de função são passados por valor (de forma que se você mudar o valor do parâmetro dentro da função, ele não é alterado fora da função).

source: If you wish to allow a function to modify its arguments, you must pass them by reference.
pt_br: Se você deseja permitir que uma função modifique seus argumentos, você precisa passá-los por referência.

source: If you want an argument to a function to always be passed by reference, you can prepend an ampersand () to the argument name in the function definition:
pt_br: Se você quer que um argumento para uma função sempre seja passado por referência, você pode preceder o nome do argumento com um "e comercial" () na definição da função:

source: function add_some_extra( $string) {$string .= 'and something extra .';} $str = 'This is a string, '; add_some_extra($str); echo $str; / / outputs'This is a string, and something extra.'
pt_br: Valores padrão de argumentos

source: A function may define C++-style default values for scalar arguments as follows:
pt_br: Uma função pode definir valores padrão no estilo C+ + para argumentos escalares, como a seguir:

source: function makecoffee ($type = "cappuccino") {return "Making a cup of $type.\n";} echo makecoffee (); echo makecoffee ("espresso");
pt_br: function cafeteira ($tipo = "cappuccino") {return "Fazendo uma xícara de café $type.\n";} echo cafeteira (); echo cafeteira ("expresso");

source: The output from the above snippet is:
pt_br: A saída do código acima será:

source: Making a cup of cappuccino.
pt_br: Fazendo uma xícara de café cappucino.

source: Making a cup of espresso.
pt_br: Fazendo uma xícara de café expresso.

source: The default value must be a constant expression, not (for example) a variable or class member.
pt_br: O valor padrão precisa ser uma expressão constante, não (por exemplo) uma variável ou um membro de classe.

source: Note that when using default arguments, any defaults should be on the right side of any non-default arguments; otherwise, things will not work as expected.
pt_br: Note que usando argumentos padrão, qualquer padrão deve vir após os argumentos sem padrão: caso contrário, as coisas não funcionarão como esperado.

source: Consider the following code snippet:
pt_br: Considere o seguinte trecho de código:

source: function makeyogurt ($type = "acidophilus", $flavour) {return "Making a bowl of $type $flavour.\n";} echo makeyogurt ("raspberry"); / / won't work as expected
pt_br: function iogurtera ($tipo = "azeda", $sabor) {return "Fazendo uma taça de $tipo $sabor.\n";} echo iogurtera ("framboesa"); / / não funciona como esperado

source: The output of the above example is:
pt_br: A saída do exemplo acima é:

source: Missing argument 2 in call to makeyogurt() in / usr / local / etc / httpd / htdocs / php3test / functest.html on line 41 Making a bowl of raspberry.
pt_br: Missing argument 2 in call to iogurtera() in / usr / local / etc / httpd / htdocs / php3test / functest.html on line 41 Fazendo uma taça de framboesa.

source: Now, compare the above with this:
pt_br: Agora, compare o que está acima com este:

source: function makeyogurt ($flavour, $type = "acidophilus") {return "Making a bowl of $type $flavour.\n";} echo makeyogurt ("raspberry"); / / works as expected
pt_br: function iogurtera ($sabor, $tipo = "azeda") {return "Fazendo uma taça de $tipo $sabor.\n";} echo iogurtera ("framboesa"); / / funciona

source: The output of this example is:
pt_br: A saída deste exemplo é:

source: Making a bowl of acidophilus raspberry.
pt_br: Número variável de argumentos

source: PHP 4 has support for variable-length argument lists in user-defined functions.
pt_br: O PHP4 tem suporte para um número variável de argumentos nas funções definidas pelo usuário.

source: This is really quite easy, using the func_num_args(), func_get_arg(), and func_get_args() functions.
pt_br: Isto é realmente bem fácil, usando as funções func_num_args(), func_get_arg() e func_get_args().

source: No special syntax is required, and argument lists may still be explicitly provided with function definitions and will behave as normal.
pt_br: Nenhuma sintaxe especial é requerida, e a lista de argumentos ainda pode ser fornecida explicitamente com as definições de funções e se comportarão normalmente.

source: Returning values
pt_br: Retornando valores

source: Example 1. serialize() example
pt_br: Exemplo 1. serialize() example

source: (PHP 3 CVS only)
pt_br: sesam_affected_rows

source: result_id is a valid result id returned by sesam_query().
pt_br: Description

source: Session handling functions
pt_br: Manejo de sessões

source: If new_cache_expire is given, the current cache expire is replaced with new_cache_expire.
pt_br: Descrição

source: Also see the session.cache_expire configuration directive.
pt_br: Se new_cache_expire for dado, o prazo do cache atual é substituído com new_cache_expire.

source: If cache_limiter is specified, the name of the current cache limiter is changed to the new value.
pt_br: Descrição

source: These headers determine the rules by which the page content may be cached by the client and intermediate proxies.
pt_br: session_cache_limiter() retorna o nome do atual limitador do cache.

source: A value of public permits caching by proxies and the client, whereas private disallows caching by proxies and permits the client to cache the contents.
pt_br: Se o cache_limiter está especificado, o nome do limitador do cache atual é mudado para o novo valor.

source: In private mode, the Expire header sent to the client may cause confusion for some browsers, including Mozilla.
pt_br: Estes headers determinam pelas quais o conteúdo da página pode ser guardado no cache.

source: You can avoid this problem by using private_no_expire mode.
pt_br: Definindo o limitador do cache para nocache, por exemplo, rejeitaria qualquer armazenamento no cache do cliente.

source: The expire header is never sent to the client in this mode.
pt_br: Ele também poderia ser definido como private, que é um pouco mais restritivo do que public.

source: The cache limiter is reset to the default value stored in session.cache_limiter at request startup time.
pt_br: No modo private, Header expirado enviado para o cliente, pode provocar confusão para alguns para alguns navegadores incluindo o Mozilla.

source: Thus, you need to call session_cache_limiter() for every request (and before session_start() is called).
pt_br: Header expirado nunca é enviado para o cliente nesse modo.

source: Example 1. session_cache_limiter() example
pt_br: Assim, você precisa chamar session_cache_limiter() para cada pedido (e antes session_start() é chamada).

source: Also see the session.cache_limiter configuration directive.
pt_br: Exemplo 1. session_cache_limiter() exemplos

source: session_cache_expire
pt_br: Próxima

source: session_decode
pt_br: Acima

source: session_decode() decodes the session data in data, setting variables stored in the session.
pt_br: Descrição

source: Voir aussi session_encode()
pt_br: session_decode() decifra dado de sessão em data, definindo variáveis guardadas na sessão.

source: session_destroy() destroys all of the data associated with the current session.
pt_br: session_destroy() destrói tudo dos dados associados com a sessão corrente.

source: It does not unset any of the global variables associated with the session, or unset the session cookie.
pt_br: Ela não elimina nenhuma das variáveis globais associadas com a sessão, e nem o cookie de sessão.

source: This function returns TRUE on success and FALSE on failure to destroy the session data.
pt_br: Esta função retorna TRUE caso funcione e FALSE caso falhe para destruição dos dados da sessão.

source: Destroying a session
pt_br: Destruindo uma sessão

source: ?php / / Initialize the session. / / If you are using session_name( "something"), don't forget it now! session_start(); / / Unset all of the session variables. session_unset(); / / Finally, destroy the session. session_destroy();?
pt_br: ?php / / Inicializa uma sess atilde; o. / / Se voc ecirc; est aacute; usando session_name("something"), n atilde;o esque ccedil;a! session_start(); / / Eliminar todas as vari aacute;veis de sess atilde;o. session_unset(); / / Finalmente, destrui ccedil; atilde;o da sess atilde;o. session_destroy();?

source: Destroying a session with $_SESSION
pt_br: Destruindo uma sessão com $_SESSION

source: ?php / / Initialize the session. / / If you are using session_name( "something"), don't forget it now! session_start(); / / Unset all of the session variables. $_SESSION = array(); / / Finally, destroy the session. session_destroy();?
pt_br: ?php / / Inicializa uma sess atilde; o. / / Se voc ecirc; est aacute; usando session_name("something"), n atilde;o esque ccedil;a! session_start(); / / Eliminar todas as vari aacute;veis de sess atilde;o. $_SESSION = array(); / / Finalmente, destrui ccedil; atilde;o da sess atilde;o. session_destroy();?

source: session_encode() returns a string with the contents of the current session encoded within.
pt_br: Descrição

source: See also session_decode()
pt_br: session_encode() retorna uma string com o conteúdo da sessão corrente codificado em seu interior.

source: The session_get_cookie_params() function returns an array with the current session cookie information, the array contains the following items:
pt_br: Descrição

source: "lifetime" - The lifetime of the cookie.
pt_br: A função session_get_cookie_params() retorna uma matriz com informação do cookie da sessão atual, a matriz contém os seguintes items:

source: "path" - The path where information is stored.
pt_br: "lifetime" - A duração do cookie.

source: "domain" - The domain of the cookie.
pt_br: "path" - O caminho onde a informação está guardada.

source: "secure" - The cookie should only be sent over secure connections. (This item was added in PHP 4.0.4.)
pt_br: "domain" - O domínio do cookie.

source: See also the configuration directives session.cookie_lifetime, session.cookie_path, session.cookie_domain, session.cookie_secure, and session_set_cookie_params().
pt_br: "secure" - O cookie seria enviado apenas sobre conexões seguras. (Este item foi incluído no PHP 4.0.4.)

source: session_id() returns the session id for the current session.
pt_br: session_id() retorna a id de sessão para a sessão atual.

source: If id is specified, it will replace the current session id. session_id() needs to be called before session_start() for that purpose.
pt_br: Se id está especificado, irá trocar a id da sessão atual. session_id() necessita ser chamada antes de session_start() para esse propósito.

source: Depending on the session handler, not all characters are allowed within the session id.
pt_br: Dependendo do session handler, nem todos os caracteres serão permitidos dentro da id de sessão.

source: For example, the file session handler only allows characters in the range a-z, A-Z and 0-9!
pt_br: Por exemplo, o arquivo session handler permite apenas caracteres do intervalo a-z, A-Z e 0-9!

source: The constant SID can also be used to retrieve the current name and session id as a string suitable for adding to URLs.
pt_br: A constante SID também pode ser usada para devolver o nome e a id de sessão atual como uma string combinada para adicionar nas URLs.

source: Note that SID is only defined if the client didn 't send the right cookie.
pt_br: Note que SID está apenas definido se o cliente não enviou o cookie correto.

source: See also Session handling.
pt_br: Veja também Session handling.

source: See also session_start(), session_set_save_handler(), and session.save_handler.
pt_br: Veja também session_start().

source: session_is_registered() returns TRUE if there is a global variable with the name name registered in the current session.
pt_br: session_is_registered() retorna TRUE se há uma variável com o nome name registrada na sessão atual.

source: If $_SESSION (or $HTTP_SESSION_VARS for PHP 4.0.6 or less) is used, use isset() to check a variable is registered in $_SESSION.
pt_br: Se $_SESSION (ou $HTTP_SESSION_VARS para PHP 4.0.6 ou inferior) é usada, use isset() para checar se uma variável está registrada em $_SESSION.

source: If you are using $_SESSION (or $HTTP_SESSION_VARS), do not use session_register(), session_is_registered() and session_unregister().
pt_br: Se você está usando $_SESSION (ou $HTTP_SESSION_VARS), não utilize session_register(), session_is_registered() e session_unregister().

source: session_module_name() returns the name of the current session module.
pt_br: session_module_name() retorna o nome do módulo da sessão atual.

source: If module is specified, that module will be used instead.
pt_br: Se module está especificado, o nome será trocado.

source: If name is specified, the name of the current session is changed to its value.
pt_br: Descrição

source: It should contain only alphanumeric characters; it should be short and descriptive (i.e. for users with enabled cookie warnings).
pt_br: session_name() retorna o nome da sessão atual.

source: Thus, you need to call session_name() for every request (and before session_start() or session_register() are called).
pt_br: Se name está especificado, o nome da sessão atual é mudado para esse valor.

source: Example 1. session_name() examples
pt_br: O nome da sessão é retomado para o valor padrão guardado em session.name no pedido na hora de inicialização.

source: See also the session.name configuration directive.
pt_br: Exemplo 1. session_name() exemplos

source: session_module_name
pt_br: Próxima

source: Read in session data without locking the session data.
pt_br: Ler num dado de sessão sem fechar o dado da sessão.

source: Changing session data is not possible, but frameset performance will be improved.
pt_br: Mudar o dado da sessão é impossível, mas a performance do frameset será melhorada.

source: For each name, session_register() registers the global variable with that name in the current session.
pt_br: Descrição

source: If you want your script to work regardless of register_globals, you need to use the $_SESSION array.
pt_br: session_register() aceita um número de argumentos variáveis, algund deles podem ser ou uma string com o nome da variável ou uma matriz de nomes de variáveis ou outras matrizes.
